In [1]:
import pandas as pd

In [2]:
# Filter Pandas Dataframe with multiple conditions
df = pd.DataFrame({'User_id': ['234', '738', '632', '777', '834', '123'],
                   'Age': [11, 45, 56, 32, 26, 31],
                   'Hourly': [100, 93, 78, 120, 64, 115],
                   'FT_Team': ['Steelers', 'Seahawks', 'Falcons', 'Falcons', 'Patriots', 'Steelers']})

df

  User_id  Age  Hourly   FT_Team
0     234   11     100  Steelers
1     738   45      93  Seahawks
2     632   56      78   Falcons
3     777   32     120   Falcons
4     834   26      64  Patriots
5     123   31     115  Steelers

In [3]:
df.loc[(df['Hourly']>=100) &
        (df['Age'] < 60) & 
        (df['FT_Team'].str.startswith('S')),
          ['User_id', 'FT_Team']
        ]

  User_id   FT_Team
0     234  Steelers
5     123  Steelers

In [ ]:
import numpy as np
# np.where returns index 
idx = np.where((df['Hourly']>=100) & (df['Age'] < 60) & (df['FT_Team'].str.startswith('S')))
idx

(array([0, 5]),)

In [5]:
df.loc[idx]

  User_id  Age  Hourly   FT_Team
0     234   11     100  Steelers
5     123   31     115  Steelers

In [6]:
df.query('Hourly >=100 & Age < 60 & FT_Team.str.startswith("S").values')

  User_id  Age  Hourly   FT_Team
0     234   11     100  Steelers
5     123   31     115  Steelers

In [7]:
df[(df['Hourly']>=100) & (df['Age'] < 60) & (df['FT_Team'].str.startswith('S'))][['User_id', 'Age', 'Hourly']]

  User_id  Age  Hourly
0     234   11     100
5     123   31     115

In [8]:
df[df.eval('Hourly >=100 & Age < 60 & FT_Team.str.startswith("S").values')]

  User_id  Age  Hourly   FT_Team
0     234   11     100  Steelers
5     123   31     115  Steelers

In [9]:
df[df.eval('Hourly >=100 & Age < 60 & FT_Team.str.startswith("S").values')]

  User_id  Age  Hourly   FT_Team
0     234   11     100  Steelers
5     123   31     115  Steelers

In [10]:
import numpy as np
import functools
def disjunction(*conditions):
    return functools.reduce(np.logical_or, conditions)

c_1 = df.Hourly >= 100
c_2 = df.Age < 60
c_3 = df.FT_Team.str.startswith('s')

data_filtered = df[disjunction(c_1, c_2, c_3)]